{
    "type" : "global",
    "appname" : null,
    "tips" : {
        "Welcome" : {
            "description" : "The tip of the day add-on will give you a tip every day. \r\nThanks for using this add-on. \r\nAt any point, you may request a tip from the add-on by choosing \"tip Of The Day\" from the NVDA menu. To do this, press NVDA+N and then press the up arrow to find the tip of the day menu item.\r\nThe NVDA key is either insert or caps lock depending on your settings.",
            "level" : [
                "beginner",
                "intermediate",
                "advanced"
            ]
        },
        "The NVDA Key" : {
            "description" : "The NVDA key is either the insert, extended insert, or caps lock key.\r\nTo use the NVDA key, you should configure NVDA to use a key. By default, the NVDA key is set to the two insert keys. The key that is long and skinny on the number pad is the insert key. Also, the extended insert key is probably towards the top row of keys. To set your NVDA keys, open the keyboard settings dialog with the NVDA key and the letter n, and then find keyboard settings in the preferences menu.",
            "level" : [
                "beginner",
                "intermediate",
                "advanced"
            ]
        },
        "Accessing the NVDA Menu." : {
            "description" : "To access the NVDA menu, you can press the NVDA key, and the letter N at the same time.",
            "level" : [
                "beginner",
                "intermediate",
                "advanced"
            ]
        },
        "check time and date" : {
            "description" : "To check the time, hold down the nvda key and press f12.\r\nTo check the date, hold down the nvda key and press f12 twice quickly.",
            "level" : [
                "beginner",
                "intermediate"
            ]
        },
        "Getting help" : {
            "description" : "To find help, use the NVDA key and N (open the NVDA menu), then select help from the menu. in this sub-menu, you will find a users guide and a quick key reference sheet to help you learn the key combinations.",
            "level" : [
                "beginner",
                "intermediate",
                "advanced"
            ]
        },
        "Preferences" : {
            "description" : "To customize NVDA, use the NVDA key and N to open the NVDA menu, and then open the preferences sub-menu. Then press enter on the item whos preferences you wish to change and make any changes.",
            "level" : [
                "beginner",
                "intermediate",
                "advanced"
            ]
        },
        "Making NVDA start automatically when your computer starts" : {
            "description" : "You can make NVDA boot automatically when your computer starts. To do this:\r\n1.  Select preferences from the NVDA menu (NVDA+N).\r\n2.  Open the general settings.\r\n3.  Navigate to the option called automatically start nvda after I log onto windows.\r\n4.  Check this item by pressing space.\r\n5.  Save the change by pressing the OK button, or pressing the enter key.",
            "level" : [
                "beginner",
                "intermediate"
            ]
        },
        "read active window" : {
            "description" : "To read the entire active window, hold down the nvda key and press the letter b.",
            "level" : [
                "beginner",
                "intermediate",
                "advanced"
            ]
        },
        "Making NVDA start on the logon screen." : {
            "description" : "You can configure NVDA to start on the windows logon screen. Press next to learn how.",
            "level" : [
                "beginner",
                "intermediate",
                "advanced"
            ]
        },
        "Making NVDA speek on the logon screen" : {
            "description" : "The windows logon screen is where you type your account password, if you have one, when you log in. Performing these steps will also make NVDA read the windows security screen (the screen that comes up when control+alt+delete is pressed), as well as the user account control prompts that come up when you install programs, etc. \r\n\r\nNote: You must be a system administrator to set this up. If you had to have someone who had permission install NVDA for you, you probably are not a system administrator. If you are a system administrator, follow these steps, otherwise, consult your administrator for more information.\r\n\r\nTo make NVDA speak on the logon screen: \r\n1. Press NVDA+N to go to the NVDA menu. Remember that the NVDA key is the key you configured earlier which is probably insert or caps-lock.\r\n2. Press the down arrow to get to the preferences menu.\r\n3. select general settings.\r\n4. Press tab until you hear NVDA say \"Use NVDA on the Windows logon screen (requires administrator privileges)\." Press the space bar. This will check the box.\r\n5. Now press tab and you'll hear \"Use currently saved settings on the logon and other secure screens (requires administrator privileges)\"\r\n6. Press this button and press the yes button in the resulting dialog box.\r\n7. Now press okay when the general settings dialog comes back up.",
            "level" : [
                "beginner"
            ]
        },
        "Make NVDA speak on the logon and secure screens." : {
            "description" : "Press the NVDA Key.\r\nNow navigate to the general settings.\r\nNow press enter. and go to the option \"Use NVDA on the Windows logon screen (requires administrator privileges)\" then press space to check it, and press enter.",
            "level" : [
                "intermediate"
            ]
        },
        "Make NVDA speak on secure screens." : {
            "description" : "Select the \"Use NVDA on the Windows logon screen (requires administrator privileges)\" option from the general settings dialog.",
            "level" : [
                "advanced"
            ]
        },
        "Making NVDA speak your language" : {
            "description" : "You can make NVDA speak your language. If you do not speak English natively, this is a tip you should read.\r\n1. To make the NVDA interface speak your language, select your language from the general settings dialog.\r\n2. Now, after NVDA restarts, select your voice language by selecting the appropriate language from the voice settings dialog.",
            "level" : [
                "beginner",
                "intermediate",
                "advanced"
            ]
        },
        "Restarting NVDA" : {
            "description" : "If you installed NVDA and consequently  aren't running a portible copy, you can quickly restart NVDA. To do this, press Ctrl+Alt+n This requires that you had checked the box during installation called \"Create desktop icon and shortcut key (control+alt+N)\".",
            "level" : [
                "beginner",
                "intermediate",
                "advanced"
            ]
        },
        "Exiting NVDA From the NVDA Menu." : {
            "description" : "To exit NVDA you can go to the NVDA menu and press the exit button. then press the okay button when you get there. You can also restart NVDA from this dialog.",
            "level" : [
                "beginner"
            ]
        },
        "Exiting NVDA." : {
            "description" : "If you want to exit NVDA, you can either press NVDA+q, or select the exit item from the NVDA menu.",
            "level" : [
                "intermediate",
                "advanced"
            ]
        },
        "Exiting NVDA with a shortcut key." : {
            "description" : "You can always exit NVDA by pressing NVDA+q. This brings up the same dialog that selecting exit from the NVDA menu shows you.",
            "level" : [
                "beginner"
            ]
        },
        "using the Laptop Keyboard layout" : {
            "description" : "If you use a laptop, or if you would prefer to not use the number pad to control NVDA, you can set NVDA up to use a laptop keyboard layout. To do this, select laptop keyboard layout from the keyboard preferences dialog.",
            "level" : [
                "beginner",
                "intermediate",
                "advanced"
            ]
        },
        "Where am I" : {
            "description" : "Pressing NVDA + Tab will have NVDA speak what is currently focused. This can help if NVDA isn't behaving as you'd expect.",
            "level" : [
                "beginner",
                "intermediate",
                "advanced"
            ]
        },
        "Input help mode" : {
            "description" : "If you wish to learn about what a key does, then you can toggle input help mode on or off. To do this, press NVDA+1 (the number 1) and then press any key. This should help you learn what keys do. To exit input help mode, press NVDA+1 again.",
            "level" : [
                "beginner",
                "intermediate",
                "advanced"
            ]
        },
        "Using screen layout." : {
            "description" : "When navigating a webpage, you can enable or disable screen layout. Screen layout tries to make the webpage seem more natural to the visual layout. Therefore, it will present items in a way sort of similar to how they appear on screen. To make items appear more like they do in JAWS, (to make NVDA report only one link per line, or break at more convenient times) disable screen layout. You can quickly toggle this while on a webpage with NVDA+v.",
            "level" : [
                "beginner",
                "intermediate",
                "advanced"
            ]
        },
        "Using shortcut keys to navigate the web." : {
            "description" : "When navigating a webpage, you can move around quickly using different page elements as anker points. Using the arrow keys lets you move around the webpage one item at a time. This is just like moving around a normal document. There are many shortcut keys available, as you get more familiar with NVDA, you should learn these. They are explained in the users guide, and in the quick reference sheet in NVDA's help menu.",
            "level" : [
                "beginner"
            ]
        },
        "Single letter navigation" : {
            "description" : "You can use single letter navigation keys on the web, or in certain other places when NVDA is in browse mode. \r\n\r\n1 through 6 on the keyboard moves you through the corresponding heading levels. H does the same, but for all headings. \r\nA is for annotation, \r\nS is for separator, \r\nD is for landmark (general regions on a page)\r\nF is for formfield,\r\nG is for graphic. \r\nK, u, and V are for link, unvisited and visited links\r\n L is for lists and I is for list items, \r\nM is for frames, N is for blocks of text, \r\nQ is for block quotes, E is for edit boxes. R is for radio button, x is for checkboxes, and C is for combo boxes.\r\n\r\nThose are the main navigator keys you will use on the web to help speed up and navigate the web more efficiently. To learn these, go to the commands quick reference sheet in NVDA's help menu.",
            "level" : [
                "intermediate",
                "advanced"
            ]
        },
        "Moving by heading around a webpage." : {
            "description" : "Often you want to move to important items on a webpage. If the webpage is formatted correctly, you can move forward by one heading by pressing the h key. To move backwards by that same heading level, use the shift key and h. Usually headings represent areas on web pages that are useful. ",
            "level" : [
                "beginner"
            ]
        },
        "not going to Be verbose." : {
            "description" : "I assume you enjoy playing around with NVDA or reading the users guide. If not, you should go to the preferences menu and switch to intermediate or beginner mode now for this add-on, or it will omit most of the detailed instructions on what different settings dialogs do.",
            "level" : [
                "advanced"
            ]
        },
        "General settings" : {
            "description" : "The general settings dialog allows you to configure general settings for NVDA. These include whether NVDA starts when your computer starts, the current language NVDA speaks when saying things, whether updates are enabled (highly recommended to leave this checked), and more. To open the general settings dialog, go to the NVDA menu (NVDA+n) and then select general settings.",
            "level" : [
                "beginner",
                "intermediate"
            ]
        },
        "General Settings: Save configuration on exit" : {
            "description" : "This option under general settings allows you to tell NVDA to save your settings when NVDA exits. I recommend checking this, as you will manually have to save your settings if it is not checked. ",
            "level" : [
                "beginner"
            ]
        },
        "General Settings: Show exit options when exiting NVDA" : {
            "description" : "This check box lets you configure whether NVDA will ask you what you want to do before exiting. If this box is checked, NVDA will bring up an exit dialog. This dialog has several options, including letting you restart, exit, or restart with add-ons disabled. Unchecking this box will make NVDA exit silently when you tell NVDA to exit.",
            "level" : [
                "beginner"
            ]
        },
        "General Settings: Play sounds when starting or exiting NVDA" : {
            "description" : "This option is a checkbox that, when checked, tells NVDA to play sounds when it starts or exits.",
            "level" : [
                "beginner"
            ]
        },
        "General Settings: Logging level" : {
            "description" : "This combo box allows you to choose how much NVDA will log as it's running. Generally users should not need to touch this as not too much is logged by default. However if you are wanting to provide information in a bug report, then it may be a useful option. ",
            "level" : [
                "beginner"
            ]
        },
        "General Settings: Automatically start NVDA after I log on to Windows" : {
            "description" : "If this option is enabled, NVDA will start automatically as soon as you log on to Windows. This option is only available for installed copies of NVDA.",
            "level" : [
                "beginner"
            ]
        },
        "General Settings: Automatically check for updates to NVDA" : {
            "description" : "If this is enabled, NVDA will automatically check for updated versions of NVDA and inform you when an update is available. You can also manually check for updates by selecting Check for updates under Help in the NVDA menu.",
            "level" : [
                "beginner"
            ]
        },
        "Synthesizer Selection (NVDA+control+s)" : {
            "description" : "\"Synthesizer...\" in the Preferences menu, allows you to select your speech synthesizer, your sound card, and  configure NVDA's ability to lower the volume of audio from other applications.\r\n\r\n9.1.2 In the user's guide explains this settings dialog in more detail.",
            "level" : [
                "beginner",
                "intermediate"
            ]
        },
        "Voice settings." : {
            "description" : "This dialog allows you to select all the options you can set for the current voice, including, but not limited to: voice,  voice variant,  volume and speech rate and more. To learn about what options are available, select \"user guide\" from the NVDA help menu and navigate to section 9.1.3.",
            "level" : [
                "beginner",
                "intermediate"
            ]
        },
        "The Synthesiser settings Ring" : {
            "description" : "Want to change things like voice, variant, rate, pitch and the like while using NVDA without having to open voice settings? Holding NVDA + Control, then using left and right arrows to select an option, then using up and down arrows to adjust it will allow you to do so. Note: If you are using laptop keyboard layout, please use NVDA + Control + Shift and the arrows.",
            "level" : [
                "beginner",
                "intermediate",
                "advanced"
            ]
        },
        "All about the Clipboard" : {
            "description" : "NVda can speak the text on the clipboard, just press NVDA + C. If you wish to see what text you have selected instead, press NVDA + Shift + up arrow (NVDA+shift+s in laptop mode). It is also possible to use NVDA's own copy functionality. navigate to the beginning of your selection and press NVDA + F9 to set a start marker, move to where you would like to set the end marker, then press NVDA + F10. The text will automatically be selected. To copy it, press NVDA+f10 again.\r\n\r\nNote: the functionality of NVDA+f10 changed in NVDA 2016.3. In previous versions, text would automatically be coppied on selection when pressing NVDA+f10, but now, the first press only selects the text, with the second press copying the selection. If you would like to restore the old way of doing things, use an add-on like classic selection.",
            "level" : [
                "intermediate",
                "advanced"
            ]
        },
        "detecting progress with progress alerts" : {
            "description" : "If you wish to change the way NVDA behaves when giving you progress updates, press NVDA + U to cycle through the modes. The available modes are: speech every 10 percent, speech at each 10 percent and beeps every 1 percent, or beeps every percent.",
            "level" : [
                "beginner",
                "intermediate",
                "advanced"
            ]
        },
        "Finding your position in a document" : {
            "description" : "It may prove useful to find out where you are in a document. To do this, press Any of the following commands. If you are using laptop mode, to have NVDA read the current character, press NVDA + NUMPAD 2. To have this happen in desktop mode, press NVDA + dot. To do much more with finding out where you are, the commands are listed in the keyboard reference sheet in NVDA's help menu.",
            "level" : [
                "intermediate",
                "advanced"
            ]
        },
        "Focus and browse mode, part 1." : {
            "description" : "When you are navigating a web page and want to enter text into an edit field, you need to switch to browse mode. To quickly do this on an edit field, press enter when you approach the field. Note that if you're using the tab and shift+tab keys to navigate the page, you don't have to do this, as the modes are switched automatically",
            "level" : [
                "beginner",
                "intermediate",
                "advanced"
            ]
        },
        "Browse mode and focus mode, Part Two" : {
            "description" : "When a webpage first opens, it usually opens in browse mode. In this mode, you can move around the page like you would a normal document.\r\nOn a well designed page, you may be able to press the letter d to move between regions (called land marks) of the page. They indicate parts of the page, such as main, complementary, and content-info.\r\n* Main is the main part of the page. It should contain the contents of most importance.\r\n* Contentinfo is information that is in a footer and isn't directly part of the page.\r\n* navigation is used for navigation menus, or other controls that help you navigate the web site or online application.\r\n* there are other landmarks, and web authors can provide custom regions as well. If this is done, you will hear \"region\" with a custom name provided before this. \r\nafter you use these quick keys to find the region you want, you can read just like you would read a normal document. For example, you might find the home page of a restaurants website, read using the arrow keys about them, and then press d to move to the navigation landmark. After doing this, you could find the link to their contact and location page, (Using the arrow keys, and control + arrow keys) and press enter to open the contact and location page. Once it is up, you could press d until you hear \"main landmark\" and use this to find their address."
            "level" : [
                "beginner",
                "intermediate",
                "advanced"
            ]
        },
        "Table Navigation" : {
            "description" : "You may encounter tables on the web, in a spreadsheet, or in your word processor. Here are a few tips to get you started navigating around them.\r\n\r\nHold Control and Alt, and use left and right to move between columns, and up and down to navigate through the rows. If you wish to move outside the table, press the comma key.",
            "level" : [
                "intermediate",
                "advanced"
            ]
        },
        "The web find dialog" : {
            "description" : "Often while navigating a webpage, it is convenient to find a known string of text. For example, if you are told to open the \"authorize receipts\" tab of a university procurement center webpage, simply pressing NVDA + Control + F will bring up a dialog allowing you to type a search query and have NVDA search for a textual match. The option regarding case sensitivity controls whether the text matches letters in both uppercase, or treats capital and lowercase letters the same. This feature works in browse mode documents.",
            "level" : [
                "beginner",
                "intermediate",
                "advanced"
            ]
        },
        "navigating the system tray." : {
            "description" : "The system tray, also known as the notification area, is the part of windows where the notifications appear. On this list of icons, there are often application icons. To get there, press windows+b, or tab to it from the desktop.",
            "level" : [
                "beginner"
            ]
        },
        "Effectively navigating ribbon menus." : {
            "description" : "Menus such as the ribbon menus found in office 2007 or later, or file explorer in windows 8 or later require some tricks to effectively navigate with a screen reader. \r\n1. Pressing alt opens these menus, just like pressing alt in other applications opens the menu bars.\r\n2. To navigate across groups like home, insert, and view, press the left or right arrow keys.\r\n3. to open a group, press enter. Down arrow can work sometimes, but isn't consistent.\r\n4. Once you have entered the group you wish, there are subgroups. pressing control + right or left arrow will move you across these sub-groups. For example, on the home tab of word, there is \"edit\", \"style\", \"font\" and more. \r\n5. Then, to find the item you want, press the tab key until you get there. Arrow keys may work, but things can be vertically stacked so this may not provide a consistent experience.",
            "level" : [
                "beginner",
                "intermediate"
            ]
        },
        "Audio Ducking" : {
            "description" : "NVDA can lower the volume of background audio either when it is speaking, or always. To configure this, select audio ducking from the NVDA synthesizer dialog. You may also press NVDA+shift+d to cycle through the three audio ducking modes at any point.",
            "level" : [
                "beginner",
                "intermediate",
                "advanced"
            ]
        },
        "Opening the NVDA Log" : {
            "description" : "If you encounter some trouble with NVDA, and need to contact a developer, you may be asked to provide a log. Press NVDA F1 to open up the NVDA log viewer. You can move up and down, and select text just like in any editor.",
            "level" : [
                "beginner",
                "intermediate",
                "advanced"
            ]
        },
        "Audible Feedback for Spelling Mistakes or Typos" : {
            "description" : "Since NVDA version 2016.2, you can now hear audible feedback when you make a spelling mistake. Report Spelling errors must be on in the Document Formatting Dialog and Play sound for spelling errors while typing must be on in the Keyboard Settings dialog (which is the default). You must also be working from within an app that checks your spelling and marks spelling errors with a red squiggly line. Firefox and Microsoft Word will do this, as will google Chrome when working in a rich text editor.",
            "level" : [
                "beginner",
                "intermediate",
                "advanced"
            ]
        },
        "NVDA Configuration Profiles" : {
            "description" : "NVDA Configuration Profiles are a great way to customize the behaviors you want to take place under certain situations. Profiles can be created in one of three types:\r\n\r\n1. Manual activation - the profile needs to be bound to a key to be activated\r\n2. App Specific - The profile takes over when the app in which it was created gains focus\r\n3. Triggers, such as say all - Profiles which are instantiated whenever a say all or custom trigger is activated",
            "level" : [
                "intermediate",
                "advanced"
            ]
        }
    }
}